app/Livewire/Components/AnySearch.php

select * from `products` where `name` like '%15 %' limit 3
select * from `services` where `name` like '%15 %' limit 3
select * from `packages` where `name` like '%15 %' limit 3
---
    public function updatedSearch($value): void
    {
        if (strlen($value) >= 3) {
            $this->showDropdown = true;
            $this->products = Product::where('name', 'like', '%' . $value . '%')->limit(3)->get();
            $this->services = Service::where('name', 'like', '%' . $value . '%')->limit(3)->get();
            $this->packages = Package::where('name', 'like', '%' . $value . '%')->limit(3)->get();