app/Livewire/Service/HomeService.php

select * from `services`
---
    public function home()
    {
        return view('livewire.service.index',
            ['services' => Service::all()]
        );